
## Plan Result




<pre><code>Plan: 1 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.lau_idam_db_user
* Update
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.flyway_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
        id                      = "https://lau-aat.vault.azure.net/secrets/case-backend-POSTGRES-PASS/ed57e206e1bf447185aafc9868984b0d"
        name                    = "case-backend-POSTGRES-PASS"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-USER" {
        id                      = "https://lau-aat.vault.azure.net/secrets/case-backend-POSTGRES-USER/4c627aa4f73a4037aee696f3c688ce3a"
        name                    = "case-backend-POSTGRES-USER"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
        id                      = "https://lau-aat.vault.azure.net/secrets/case-backend-POSTGRES-HOST/3a1df73f536c40cebe527b22f6ac31e6"
        name                    = "case-backend-POSTGRES-HOST"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flyway_password will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flyway_password" {
        id                      = "https://lau-aat.vault.azure.net/secrets/flyway-password/85fc66b06e6746bcb6a4aa9193d76974"
        name                    = "flyway-password"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.lau_idam_db_user will be created
  + resource "azurerm_key_vault_secret" "lau_idam_db_user" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat"
      + name                    = "idam-backend-app-db-user-flexible"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 1 to add, 4 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":491,"Program":"tfcmt","SHA1":"","Vars":{}} -->